#coding=utf-8
'''
Created on 2017-11-28

@author: joneking
'''
import requests
import xml
import re
from bs4 import BeautifulSoup
import time

'''
#打开主页
r=requests.get('http://www.biqukan.com/1_1094/')
#print (r.text)
#取出主页里面的目录
p2=r'(?<=<dd><a href=").+?(?=</a></dd>)'
pattern2 = re.compile(p2)
matcher2 = re.findall(pattern2,r.text)
print (matcher2)
#去掉前面的最新章节
ma= matcher2[12:]
'''
ma=['/1_1094/15648395.html">第991章 肉身半神！', '/1_1094/15658509.html">第992章 重临冰原', '/1_1094/15661164.html">第993章 焦急！！', '/1_1094/15673165.html">第994章 我一定可以阻止……', '/1_1094/15677320.html">第995章 最强天人', '/1_1094/15688744.html">第996章 降临巨鬼城！', '/1_1094/15693230.html">第997章 我回来了', '/1_1094/15706193.html">第998章 我让你们……停手！', '/1_1094/15709244.html">第999章 战半神！', '/1_1094/15724859.html">第1000章 逆天恢复！', '/1_1094/15728113.html">第1001章 罢战，不打了', '/1_1094/15738754.html">第1002章 天尊之手！', '/1_1094/15742255.html">第1003章 再次对决！', '/1_1094/15754108.html">第1004章 你的命运！', '/1_1094/15757375.html">第1005章 第二次', '/1_1094/15769110.html">第1006章 缘由', '/1_1094/15772937.html">第1007章 一滴眼泪', '/1_1094/15783067.html">第1008章 你们怎么如此自私！', '/1_1094/15786688.html">第1009章 二十二色火！', '/1_1094/15797431.html">第1010章 连天烽火！', '/1_1094/15800981.html">第1011章 血气冲天', '/1_1094/15818508.html">第1012章 血祖复活！', '/1_1094/15821981.html">第1013章 三叩谢师恩', '/1_1094/15837629.html">第1014章 或有一丝', '/1_1094/15841000.html">第1015章 永恒之龟', '/1_1094/15856137.html">第1016章 从来没有世界之门！', '/1_1094/15859514.html">第1017章 我还是恨你！', '/1_1094/15871572.html">第1018章 绝望的魁皇城', '/1_1094/15875306.html">第1019章 魁祖的气息！', '/1_1094/15886627.html">第1020章 一触即发！', '/1_1094/15890427.html">第1021章 鳄首！', '/1_1094/15903775.html">第1022章 四大凶兽！', '/1_1094/15906236.html">第1023章 通天道门', '/1_1094/15918591.html">第1024章 一目晶渊', '/1_1094/15921862.html">第1025章 长生灯！', '/1_1094/15923072.html">第1026章 绝伦道法！', '/1_1094/15932394.html">第1027章 第十道门', '/1_1094/15935785.html">第1028章 天崩地裂！', '/1_1094/15946459.html">第1029章 白秀才', '/1_1094/15949392.html">第1030章 庙里的故事，故事外的人', '/1_1094/15961737.html">第1031章 那一丝温暖！', '/1_1094/15964394.html">第1032章 打劫白小纯', '/1_1094/15974431.html">第1033章 第一个故人', '/1_1094/15976994.html">第1034章 恭喜岳父', '/1_1094/15987779.html">第1035章 邪皇旨意', '/1_1094/15990816.html">第1036章 鬼母坐镇', '/1_1094/16002793.html">第1037章 希望与崛起', '/1_1094/16006303.html">第1039章 斩大尊！', '/1_1094/16019863.html">第1040章 莫非蝗虫来过？', '/1_1094/16023174.html">第1041章 又见鬼母！', '/1_1094/16031992.html">第1042章 激战鬼母', '/1_1094/16037610.html">第1043章 惊人战舟', '/1_1094/16046928.html">第1044章 干把大的！！', '/1_1094/16049981.html">第1045章 悲催鬼脸', '/1_1094/16062734.html">第1046章 封印', '/1_1094/16066403.html">第1047章 醒来！', '/1_1094/16076725.html">第1048章 小哥哥', '/1_1094/16080297.html">第1049章 重塑道心！', '/1_1094/16089957.html">第1050章 你那死爹…', '/1_1094/16092883.html">第1051章 念', '/1_1094/16102810.html">第1052章 来者不善', '/1_1094/16105844.html">第1053章 白道友，请！', '/1_1094/16115207.html">第1054章 圣皇城', '/1_1094/16117160.html">第1055章 华丽登场', '/1_1094/16127943.html">第1056章 通天公', '/1_1094/16129870.html">第1057章 勿谓言之不预', '/1_1094/16139072.html">第1058章 吃了啊', '/1_1094/16141167.html">第1059章 欺人太甚', '/1_1094/16149760.html">第1060章 龙鱼也疯狂', '/1_1094/16153137.html">第1061章 天龙鱼，跟我走', '/1_1094/16165536.html">第1062章 出大事了……', '/1_1094/16169994.html">第1063章 陛下您的鱼……', '/1_1094/16184000.html">第1064章 你们一定会后悔……', '/1_1094/16187260.html">第1065章 监公使', '/1_1094/16198565.html">第1066章 莲宴', '/1_1094/16202166.html">第1067章 好东西', '/1_1094/16211502.html">第1068章 小点声', '/1_1094/16213620.html">第1069章 龟赃并获', '/1_1094/16221882.html">第1070章 是白小纯让我干的！', '/1_1094/16225462.html">第1071章 还有藕……', '/1_1094/16236469.html">第1072章 荷花蔫了……', '/1_1094/16239872.html">第1073章 天尊劫！', '/1_1094/16248543.html">第1074章 列位天尊天下知！', '/1_1094/16250496.html">第1075章 道种', '/1_1094/16261297.html">第1076章 自创道路！', '/1_1094/16264126.html">第1077章 亘古卷！', '/1_1094/16272530.html">第1078章 残扇撞击！', '/1_1094/16275008.html">第1079章 圣皇，那个我身体不太舒服……', '/1_1094/16288978.html">第1080章 降临残扇', '/1_1094/16290300.html">第1081章 整装待发', '/1_1094/16302143.html">第1082章 来打我！', '/1_1094/16305990.html">第1083章 主宰气息！', '/1_1094/16315468.html">第1084章 传承机缘！', '/1_1094/16318114.html">第1085章 最恨别人作弊！', '/1_1094/16331087.html">第1086章 给扇子炼炼灵', '/1_1094/16334048.html">第1087章 挤进去了……', '/1_1094/16342737.html">第1088章 原来我是守护者', '/1_1094/16347948.html">第1089章 绝望的广目天尊', '/1_1094/16360722.html">第1090章 钻了空子', '/1_1094/16364124.html">第1091章 我再给你们加点！', '/1_1094/16373803.html">第1092章 太善良了', '/1_1094/16377275.html">第1093章 邀请', '/1_1094/16385521.html">第1094章 敢阴我？', '/1_1094/16388018.html">第1095章 说好的死不从……', '/1_1094/16399590.html">第1096章 广目归来', '/1_1094/16402504.html">第1097章 白小纯，一定是你', '/1_1094/16411806.html">第1098章 十二天尊', '/1_1094/16415493.html">第1099章 一把钥匙', '/1_1094/16427510.html">第1100章 我要低调', '/1_1094/16430871.html">第1101章 欺负我？', '/1_1094/16441146.html">第1102章 继续低调', '/1_1094/16442298.html">第1103章 他是白小纯', '/1_1094/16455163.html">第1103章 继续低调', '/1_1094/16455164.html">第1104章 欺人太甚', '/1_1094/16458508.html">第1105章 你同意不同意', '/1_1094/16468080.html">第1106章 抓狂', '/1_1094/16469524.html">第1107章 小纯出场', '/1_1094/16475947.html">第1108章 强行抹黑', '/1_1094/16477905.html">第1109章 交锋与妥协', '/1_1094/16485819.html">第1110章 重逢大天师', '/1_1094/16489864.html">第1111章 天师三策', '/1_1094/16499398.html">第1112章 你要什么', '/1_1094/16502581.html">第1113章 北部界主', '/1_1094/16511102.html">第1114章 说不清道不明的关系……', '/1_1094/16518844.html">第1115章 任意门', '/1_1094/16531276.html">第1116章 生死道源', '/1_1094/16533780.html">第1117章 我发誓一定弄死你', '/1_1094/16546325.html">第1118章 云海自治州', '/1_1094/16549823.html">第1119章 黑丹一族', '/1_1094/16558778.html">第1120章 谁是怪丹老祖？', '/1_1094/16562573.html">第1121章 小纯出手', '/1_1094/16576983.html">第1122章 接招吧！', '/1_1094/16587966.html">第1123章 我们造了什么孽', '/1_1094/16592508.html">第1124章 您走吧', '/1_1094/16603419.html">第1125章 太古魂', '/1_1094/16607175.html">第1126章 中了……', '/1_1094/16616771.html">第1127章 周大师？', '/1_1094/16619777.html">第1128章 吓到了', '/1_1094/16631063.html">第1129章 回家', '/1_1094/16635357.html">第1130章 妖孽，你们走开', '/1_1094/16645429.html">第1131章 魅后', '/1_1094/16649045.html">第1132章 突变！', '/1_1094/16660280.html">第1133章 玄九危机', '/1_1094/16663423.html">第1134章 诡异村庄', '/1_1094/16673445.html">第1135章 玄九郡', '/1_1094/16675722.html">第1136章 天坑', '/1_1094/16686630.html">第1137章 激战', '/1_1094/16690091.html">第1138章 白小纯，你疯了啊', '/1_1094/16698529.html">第1139章 白胖子……', '/1_1094/16701559.html">第1140章 玄九郡灭！', '/1_1094/16713147.html">第1141章 天尊中期', '/1_1094/16716186.html">第1142章 现在念', '/1_1094/16728868.html">第1143章 生死现在经', '/1_1094/16732117.html">第1144章 你敢勒索我？', '/1_1094/16768418.html">第1145章 惹不起', '/1_1094/16772546.html">第1146章 我要弄死你！', '/1_1094/16783727.html">第1147章 卑鄙无耻下流', '/1_1094/16787107.html">第1148章 大变降临', '/1_1094/16796152.html">第1149章 养蛊', '/1_1094/16799565.html">第1150章 战通天', '/1_1094/16810299.html">第1151章 天尊丹', '/1_1094/16813176.html">第1152章 争夺', '/1_1094/16821945.html">第1153章 阵破', '/1_1094/16825640.html">第1154章 好机会！', '/1_1094/16835184.html">第1155章 抢到手', '/1_1094/16837455.html">第1156章 没了！', '/1_1094/16844894.html">第1157章 是他，一定是他', '/1_1094/16847081.html">第1158章 小器灵，和我都？', '/1_1094/16854764.html">第1159章 嘘', '/1_1094/16856907.html">第1160章 冲出去', '/1_1094/16865818.html">第1161章 你敢动我好兄弟！', '/1_1094/16868053.html">第1162章 尾巴呢', '/1_1094/16879317.html">第1163章 我吃了！', '/1_1094/16889957.html">第1164章 圣皇朝大使', '/1_1094/16890552.html">第1165章 谁怕谁？', '/1_1094/16893975.html">第1166章 战关卡', '/1_1094/16904294.html">第1167章 重逢', '/1_1094/16907917.html">第1168章 绝密！', '/1_1094/16917408.html">第1169章 皇子宴', '/1_1094/16919952.html">第1170章 大皇子，请自重！', '/1_1094/16930814.html">第1171章 自由的狗', '/1_1094/16934624.html">第1172章 福利。。。', '/1_1094/16943299.html">第1173章 满载而归', '/1_1094/16947611.html">第1174章 暗藏杀机', '/1_1094/16956444.html">第1175章 他笑了', '/1_1094/16959511.html">第1176章 传承', '/1_1094/16959511.html">第1176章 传承1 biqukan.com', '/1_1094/16959511.html">第1176章 传承2 biqukan.com']


print (ma[:])
#打开文件
fileHandle = open ( 'D:/test.txt', 'a+' )
#用循环去读取每一张里面的内容
for i in range(len(ma)):
    print (ma[i])
    maa=re.split(r'">',ma[i])
    fileHandle.write (maa[1])
    fileHandle.write ('\n')
    url='http://www.biqukan.com'+maa[0]
    print (url)
    r=requests.get(url)
    tt=r.text
    p1=r'(?<=class="showtxt">).*?(?=<script>read3\(\);</script>)'
    pattern1 = re.compile(p1, re.I|re.S|re.M)
    matcher1 = re.findall(pattern1,tt)
    print (matcher1)
    ss= matcher1[0].replace('&nbsp;', '').replace('<br /><br />','\n')
    fileHandle.write (ss)
fileHandle.close()
'''

ma=['/1_1094/5855788.html']
for i in range(len(ma)):
    url='http://www.biqukan.com'+ma[i]
    print (url)
    r=requests.get(url)
    #print r.text
    tt=r.text
    p1=r'(?<=class="showtxt">).*?(?=<script>read3\(\);</script>)'
    pattern1 = re.compile(p1, re.I|re.S|re.M)
    matcher1 = re.findall(pattern1,tt)
    print (matcher1)
    ss= matcher1[0].replace('&nbsp;', '').replace('<br /><br />','\r\n')
    print(ss)
    fileHandle = open ( 'D:/test.txt', 'a+' )
    fileHandle.write ( ss)
    fileHandle.close()
'''

"""
#字典的形式，还没理解透彻
p1=r'(?P<first_name>(?<=<dd><a href=").+?(?=">))'
pattern1 = re.compile(p1)
matcher1 = re.finditer(pattern1,r.text)
print ([m.groupdict() for m in matcher1])


#案例1
import requests ##导入requests
from bs4 import BeautifulSoup ##导入bs4中的BeautifulSoup

res = requests.get('http://sz.58.com/nanshan/zufang/0/j2/?minprice=0_1600&PGTID=0d300008-0071-367d-7e8f-38bb92b6eebc&ClickID=2') 
res.encoding='utf-8'
soup=BeautifulSoup(res.text,'html.parser')

for info in soup.select('li'):
    a=info.select('.des .room')[0].text.replace(" ","")
    b=info.select('.des .add')[0].text.replace(" ","")
    c=info.select('.listliright .sendTime')[0].text.replace(" ","")
    d=info.select('.listliright .money')[0].text
    
    print(a,b,c,d)
    print(".....................................................")

#案例2
import HTMLParser
html_cont =  "&nbsp;asdfg&gt;123&lt;"  
  
html_parser = HTMLParser.HTMLParser()  
new_cont = html_parser.unescape(html_cont)  
print new_cont  #new_cont = " asdfg>123<"</div>  

#案列3
ss=" &nbsp; 2323 2&nbsp;3 "
soup=BeautifulSoup(ss,'html.parser')
s=(" &nbsp; 2323 2&nbsp;3 ".replace('&nbsp;', ''))
print (s)
print (soup)
"""